#### Terraform Initialization ⚙️　`success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan Result</summary>

```terraform
 region                 = "ap-northeast-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-efs-sg"
          + "Project"     = "wordpress-bedrock"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "wordpress-bedrock-prod-efs-sg"
          + "Project"     = "wordpress-bedrock"
        }
      + vpc_id                 = "vpc-023c8aac08314c0b6"
    }

  # aws_vpc_security_group_egress_rule.efs_all will be created
  + resource "aws_vpc_security_group_egress_rule" "efs_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "efs-all-egress"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "efs-all-egress"
          + "Project"     = "WordPress-Bedrock"
        }
    }

  # aws_vpc_security_group_ingress_rule.efs_from_ecs will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs_from_ecs" {
      + arn                          = (known after apply)
      + description                  = "Allow NFS from ECS tasks"
      + from_port                    = 2049
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = "sg-0731157ea8a1cf809"
      + region                       = "ap-northeast-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Name" = "efs-from-ecs-ingress"
        }
      + tags_all                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "efs-from-ecs-ingress"
          + "Project"     = "WordPress-Bedrock"
        }
      + to_port                      = 2049
    }

Plan: 11 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs_task_definition_arn             = "arn:aws:ecs:ap-northeast-1:662478938633:task-definition/wordpress-bedrock-prod-wordpress:1" -> (known after apply)
  + efs_dns_name                        = (known after apply)
  + efs_id                              = (known after apply)
  + efs_plugins_access_point_id         = (known after apply)
  + efs_themes_access_point_id          = (known after apply)
  + phase10_summary                     = (known after apply)
  ~ phase9_summary                      = <<-EOT
        ========================================
        Phase 9: ECS Service - Complete
        ========================================
        
        ECS Service:
        - Name: wordpress-bedrock-prod-wordpress-service
        - Launch Type: Fargate
        - Desired Count: 2
        - Platform Version: LATEST
        
        Auto Scaling:
        - Min Capacity: 2
        - Max Capacity: 4
        - CPU Target: 70%
        - Memory Target: 80%
        
        Network:
        - Subnets: 2 private subnets
        - Security Group: sg-0731157ea8a1cf809
        - Public IP: Disabled
        
        Load Balancer:
        - Target Group: wp-20260128135824911400000001
        - Container Port: 80
        
        Deployment:
        - Circuit Breaker: Enabled with rollback
        - Maximum: 200%
        - Minimum Healthy: 100%
        
        CloudWatch Alarms:
        - CPU utilization > 85%
        - Memory utilization > 90%
        - Running task count < minimum
        
        WordPress URL: http://wordpress-bedrock-prod-alb-796184839.ap-northeast-1.elb.amazonaws.com
        
        Next Steps:
      - - Phase 10: Create Route53 DNS and ACM Certificate
      - - Phase 11: Create Lambda for image generation
      - - Phase 12: Create API Gateway webhook
      + - Phase 10: Create EFS for plugin/theme sharing
      + - Phase 11: Create Route53 DNS and ACM Certificate
      + - Phase 12: Create Lambda for image generation
      + - Phase 13: Create API Gateway webhook
        
        ========================================
    EOT

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @takahiro1226, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*